{
  "layout":{
      "home": "Home",
      "about": "About",
      "resume": "Experience",
      "skills": "Skills",
      "studies": "Studies",
      "projects": "Projects",
      "socialMedia": "Social Media"
  },
  "home": {
    "title": "Hi! I'm",
    "subtitle": "Frontend Developer",
    "work": "View My Projects",
    "cv": "View My CV"
  },
  "about": {
    "title": "About me",
    "subtitle": "My Approach as a Developer",
    "description": "I turn complex ideas into robust and efficient digital solutions. I specialize in creating the secure and scalable core that your application needs, using key technologies such as Node.js and TypeScript.",
    "description2": "My commitment is to deliver maintainable code that not only solves problems today but also drives the future growth of your project, ensuring seamless integration with the frontend.",
    "creative": "Creative Problem Solving",
    "creativeDescription": "I approach every project with a creative mindset, looking for innovative ways to tackle challenges and deliver unique solutions.",
    "collaborative": "Collaborative Spirit",
    "collaborativeDescription": "I strongly believe that the best results come from teamwork. I enjoy collaborating with developers, product managers, and stakeholders.",
    "constant": "Constant Growth",
    "constantDescription": "I am committed to professional growth, constantly seeking to expand my skills and knowledge to stay at the forefront of the industry."
  },
  "skill": {
    "title": "What I do"
  },
  "resume": {
    "subtitle": "Working Experience",
    "workTitleOne": "Software Development",
    "workDateOne": "Feb 2025 - Aug 2025",
    "workDescriptionOne": "'Developed and maintained web applications using React and Node.js.', 'Implemented RESTful APIs and integrated with various third-party services such as Google APIs.', 'Collaborated with cross-functional teams to define, design, and ship new features.'",
    "workTitleTwo": "Software Development",
    "workDateTwo": "Jun 2024",
    "workDescriptionTwo": "Responsible for implementing interface logic and optimizing design for different devices, using tools such as JavaScript, CSS3, Tailwind, and functional methodologies."
  },
  "studies": {
    "title": "Studies",
    "titleCertificate": "View Certificate",
    "studyTitleOne": "JavaScript University",
    "studyDescriptionOne": "Acquire and master the fundamentals of programming, while learning to organize and structure your code following the best practices of the JavaScript language.",
    "studyTitleTwo": "Learn Fundamentals Of Node.js Programming",
    "studyDescriptionTwo": "Learn and understand Node.js programming from scratch with practical examples and exercises.",
    "studyTitleThree": "SQL: Creating Databases",
    "studyDescriptionThree": "Master the design, creation, and management of SQL databases efficiently using the MySQL database management system.",
    "studyTitleFour": "MongoDB and NoSQL Database Course",
    "studyDescriptionFour": "Learn NoSQL with MongoDB from scratch, without prior knowledge, and perform Queries, relationships, data schemas, and CRUD.",
    "studyTitleFive": "Master on HTML and CSS",
    "studyDescriptionFive": "Learn HTML and CSS without any prior knowledge for the development, modification, and visualization of web elements."
  },
  "projects": {
    "title": "My Projects",
    "subtitle": "Check out some of my projects",
    "dayTitle": "DATE",
    "typeTitle": "TYPE",
    "patterTitle": "PATTERN",
    "tech": "TECH STACK",
    "link": "View more",
    "read": "Read more",
    "lifePost": {
      "title": "LifePost",
      "description": "LifePost is an application designed to provide inspiration and motivation, as well as a sanctuary where people can freely express themselves.",
      "longDescription": "A space where everyone has the opportunity to share their stories with the world.",
      "date": "Feb, 2024",
      "type": "Monolithic Web Application",
      "pattern": "MVC",
      "techStack": "Node js · Express · Pug"
    },
    "ImageOptimizator": {
      "title": "Image Optimizator",
      "description": "It is an MVC application designed to optimize and compress images, utilizing the JavaScript runtime environment Node.js and Express.js.",
      "longDescription": "Optimize your images for your projects and websites.",
      "date": "Jan, 2024",
      "type": "Monolithic Web Application",
      "pattern": "MVC",
      "techStack": "Node js · Express-js · Ejs"
    },
    "listUserApi": {
      "title": "listuser-api",
      "description": "listuser-api is a mini API created for a technical test. Provides user management through functionalities such as user creation, listing, updating, and deletion.",
      "longDescription": "listuser provides an efficient and easy way to manage and list users.",
      "date": "Dec, 2024",
      "type": "API / Back-End",
      "pattern": "hexagonal architecture",
      "techStack": "NodeJS · Express · Yup · typescript · jsonwebtoken"
    },
    "listuser": {
      "title": "listuser",
      "description": "listuser is an application created to display the views of the listuser-api. It provides user management such as creating, listing, updating and deleting users.",
      "longDescription": "The main objective of Listuser is to demonstrate an efficient and simple way of how the listuser-api works in real-time.",
      "date": "Dec, 2024",
      "type": "SPA / Front-End",
      "pattern": "screen architecture",
      "techStack": "typescript · react"
    }
  },
  "socialMedia":{
    "solcial": "Social Media"
  }
}
