{
    "layout":{
      "home": "Home",
      "about": "Acerca ",
      "skill": "Habilidades",
      "resume": "Experiencia",
      "studies": "Estudios",
      "projects": "Proyectos",
      "socialMedia": "Redes"
  },
  "home": {
    "title": "Hola!",
    "subtitle": "Frontend Developer",
    "work": "Ver Mi Proyectos",
    "cv": "Ver My CV"
  },
  "about": {
    "title": "Acerca de mí",
    "subtitle": "Mi Enfoque como Desarrollador",
    "description": "Convierto ideas complejas en soluciones digitales robustas y eficientes. Me especializo en crear el núcleo seguro y escalable que tu aplicación necesita, utilizando tecnologías clave como Node.js y TypeScript.",
    "description2": "Mi compromiso es entregar código mantenible que no solo resuelva problemas hoy, sino que también impulse el crecimiento futuro de tu proyecto, asegurando una integración perfecta con el frontend.",
    "creative": "Resolución Creativa de Problemas",
    "creativeDescription": "Abordo cada proyecto con una mentalidad creativa, buscando formas innovadoras de abordar los desafíos y ofrecer soluciones únicas.",
    "collaborative": "Espíritu Colaborativo",
    "collaborativeDescription": "Creo firmemente que los mejores resultados se obtienen trabajando en equipo. Disfruto colaborando con desarrolladores, gerentes de producto y otras partes interesadas.",
    "constant": "Crecimiento Constante",
    "constantDescription": "Estoy comprometido con el crecimiento profesional, buscando constantemente ampliar mis habilidades y conocimientos para mantenerme a la vanguardia de la industria."
  },
  "skill": {
    "title": "Lo que hago"
  },
  "resume": {
    "subtitle": "Experiencia laboral",
    "workTitleOne": "Desarrollo de software",
    "workDateOne": "Feb 2025 - Ago 2025",
    "workDescriptionOne": "'Desarrollé y mantuve aplicaciones web con React y Node.js.', 'Implementé API RESTful e integré servicios de terceros como las API de Google.', 'Participe con equipos multifuncionales para definir, diseñar y lanzar nuevas funciones.'",
    "workTitleTwo": "Desarrollo de software",
    "workDateTwo": "Jun 2024",
    "workDescriptionTwo": "Encargado de la implementación de la lógica en interfaces y la optimización del diseño para distintos dispositivos, empleando herramientas como, JavaScript, CSS3, Tailwind y metodologías funcionales."
  },
  "studies": {
    "title": "Estudios",
    "titleCertificate": "Ver Certificado",
    "studyTitleOne": "Universidad JavaScript",
    "studyDescriptionOne": "Adquiere y domina los fundamentos de la programación, mientras aprendes a organizar y estructurar tu código siguiendo las mejores prácticas del lenguaje JavaScript.",
    "studyTitleTwo": "Aprende los fundamentos de la programación en Node.js",
    "studyDescriptionTwo": "Learn and understand Node.js programming from scratch with practical examples and exercises.",
    "studyTitleThree": "SQL: Creación de Bases de Datos",
    "studyDescriptionThree": "Domina el diseño, creación y gestión de bases de datos SQL de manera eficiente utilizando el sistema de gestión de bases de datos MySQL.",
    "studyTitleFour": "Curso de Base de Datos MongoDB y NoSQL",
    "studyDescriptionFour": "Aprende NoSQL con MongoDB desde 0, sin conocimientos previos y realiza Consultas, relaciones, schemas de datos y CRUD.",
    "studyTitleFive": "Master en HTML5 y CSS3",
    "studyDescriptionFive": "Aprende HTML y CSS sin ningún conocimiento previo para el desarrollo modificación, visualización de elementos web."
  },
  "projects": {
    "title": "My Projects",
    "subtitle": "Check out some of my projects",
    "dayTitle": "FECHA",
    "typeTitle": "TIPO",
    "patterTitle": "PATRÓN",
    "tech": "TECNOLOGÍA",
    "link": "Ver más",
    "read": "Leer más",
    "lifePost": {
      "title": "LifePost",
      "description": "LifePost es una aplicación diseñada para brindar inspiración y motivación, así como un santuario donde las personas pueden expresarse libremente.",
      "longDescription": "Un espacio donde todos tienen la oportunidad de compartir sus historias con el mundo.",
      "date": "Feb, 2024",
      "type": "Aplicación Web Monolítica",
      "pattern": "MVC"
    },
    "ImageOptimizator": {
      "title": "Image Optimizator",
      "description": "Es una aplicación MVC cuya función es optimizar y comprimir imágenes, utilizando el entorno de ejecución de JavaScript Node js y Express-js.",
      "longDescription": "Optimiza tus imágenes para tus trabajos y sitios web.",
      "date": "Ene, 2024",
      "type": "Aplicación Web Monolítica",
      "pattern": "MVC"
    },
    "ListApi": {
      "title": "List-api",
      "description": "listuser-api es una mini API creada para una prueba técnica. Proporciona gestión de usuarios como creación, listado, actualización y eliminación de usuarios.",
      "longDescription": "listuser proporciona una manera eficiente y sencilla de administrar y listar usuarios.",
      "date": "Dic, 2024",
      "type": "API / Back-End",
      "pattern": "Arquitectura Exagonal"
    },
    "listuser": {
      "title": "listuser",
      "description": "listuser es una aplicacion creada para mostar las vistas de la api listuser-api. Proporciona una forma sencilla de cómo funciona la API en tiempo real.",
      "longDescription": "listuser Proporciona vistas de una forma sencilla para mostrar el funcionamiento de la API de lisuser-api en tiempo real.",
      "date": "Dic, 2024",
      "type": "SPA / Front-End",
      "pattern": "screen architecture"
    }
  },
    "socialMedia":{
    "solcial": "Redes Sociales"
  }
}
